Revit 2026 API

# LevelGetNearestLevelId(Document, Double, Double) Method

---

Returns id of the Level which is closest to the specified elevation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId GetNearestLevelId(
	Document document,
	double elevation,
	out double offset
)
```
```vb
Public Shared Function GetNearestLevelId (
	document As Document,
	elevation As Double,
	<OutAttribute> ByRef offset As Double
) As ElementId
```
```cpp
public:
static ElementId^ GetNearestLevelId(
	Document^ document,
	double elevation,
	[OutAttribute] double% offset
)
```
```fsharp
static member GetNearestLevelId :
        document : Document *
        elevation : float *
        offset : float byref -> ElementId
```

#### Parameters

document Document
     The document.
elevation Double
     Target Elevation.
offset Double
     Vertical offset from the level to the target elevation.

#### Return Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The level can be at, above or below the target elevation. If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.

#### Reference

Level Class

GetNearestLevelId Overload

Autodesk.Revit.DB Namespace